import axios from "axios"

export const allFilters = async (req, res) => {
    try {
        res.status(200).json({
            filters: {
                brends: [],
                modelsByBrends: [],
                cities: ["Київ", "Харьків", "Одеса", "Дніпро", "Донецьк", "Запоріжжя", "Львів", "Кривий Ріг", "Миколаїв", "	Маріуполь", "Севастополь", "Луганськ", "Вінниця", "Сімферополь", "Макіївка", "Херсон", "Чернігів", "Полтава",  "Черкаси", "Хмельницький", "	Чернівці", "Житомир", "Суми", "Рівне", "Івано-Франківськ", "Кам'янське", "Кропивницький", "Тернопіль", "Кременчук", "Луцьк", "Біла Церква", "Краматорськ", "Мелітополь", "Керч", "Ужгород", "Бердянськ", "Нікополь", "Слов'янськ", "Бровари", "Євпаторія", "Алчевськ", "Павлоград", "Сєвєродонецьк"]
            },
        })
    } catch (error) {
        res.status(500).json({
            msg: "Error: Error while calculate currency"
        })
    }
}
